#include "global.h"
#include "main.h"
#include "battle.h"
#include "battle_anim.h"
#include "battle_factory.h"
#include "battle_interface.h"
#include "battle_message.h"
#include "battle_tent.h"
#include "bg.h"
#include "contest.h"
#include "contest_effect.h"
#include "data.h"
#include "daycare.h"
#include "decompress.h"
#include "dynamic_placeholder_text_util.h"
#include "event_data.h"
#include "frontier_util.h"
#include "gpu_regs.h"
#include "graphics.h"
#include "international_string_util.h"
#include "item.h"
#include "link.h"
#include "m4a.h"
#include "malloc.h"
#include "menu.h"
#include "menu_helpers.h"
#include "party_menu.h"
#include "palette.h"
#include "pokeball.h"
#include "pokemon.h"
#include "pokemon_icon.h"
#include "pokemon_storage_system.h"
#include "pokemon_summary_screen.h"
#include "region_map.h"
#include "scanline_effect.h"
#include "sound.h"
#include "sprite.h"
#include "string_util.h"
#include "strings.h"
#include "task.h"
#include "text.h"
#include "tv.h"
#include "window.h"
#include "constants/items.h"
#include "constants/moves.h"
#include "constants/party_menu.h"
#include "constants/region_map_sections.h"
#include "constants/rgb.h"
#include "constants/songs.h"
#include "constants/battle_config.h"

#define MOVE_SELECTOR_SPRITES_COUNT 2
#define HP_BAR_SPRITES_COUNT 9
#define EXP_BAR_SPRITES_COUNT 11

#define MOVE_SLOT_DELTA     28

enum PokemonSummaryScreenDataSpriteIds
{
    SPRITE_ARR_ID_MON,
    SPRITE_ARR_ID_BALL,
    SPRITE_ARR_ID_STATUS,
    SPRITE_ARR_ID_POKERUS_CURED_SYMBOL,
    SPRITE_ARR_ID_SHINY_STAR,
    SPRITE_ARR_ID_MON_ICON,
    SPRITE_ARR_ID_TYPE,
    SPRITE_ARR_ID_TYPE_2,
    SPRITE_ARR_ID_MOVE_1_TYPE,
    SPRITE_ARR_ID_MOVE_2_TYPE,
    SPRITE_ARR_ID_MOVE_3_TYPE,
    SPRITE_ARR_ID_MOVE_4_TYPE,
    SPRITE_ARR_ID_MOVE_5_TYPE,  // move to learn
    SPRITE_ARR_ID_MOVE_SELECTOR1,
    SPRITE_ARR_ID_MOVE_SELECTOR2 = SPRITE_ARR_ID_MOVE_SELECTOR1 + MOVE_SELECTOR_SPRITES_COUNT,
    SPRITE_ARR_ID_COUNT = SPRITE_ARR_ID_MOVE_SELECTOR2 + MOVE_SELECTOR_SPRITES_COUNT
};

#define TILE_EMPTY_HEART  0x1201
#define TILE_FILLED_HEART 0x1200
#define TILE_EMPTY        0x1000

enum
{
    SUMMARY_BG_INFO_PAGE,
    SUMMARY_BG_SKILLS_PAGE,
    SUMMARY_BG_BATTLE_MOVES_PAGE,
    SUMMARY_BG_CONTEST_MOVES_PAGE,
    SUMMARY_BG_BATTLE_MOVES_DETAILS_PAGE,
    SUMMARY_BG_CONTEST_MOVES_DETAILS_PAGE,
    SUMMARY_BG_EGG_INFO_PAGE,
    SUMMARY_BG_COUNT,
};

static EWRAM_DATA struct PokemonSummaryScreenData
{
    /*0x00*/ union {
        struct Pokemon *mons;
        struct BoxPokemon *boxMons;
    } monList;
    /*0x04*/ MainCallback callback;
    /*0x0C*/ struct Pokemon currentMon;
    /*0x70*/ struct PokeSummary
    {
        u16 species; // 0x0
        u16 species2; // 0x2
        u8 isEgg; // 0x4
        u8 level; // 0x5
        u8 ribbonCount; // 0x6
        u8 ailment; // 0x7
        u8 abilityNum; // 0x8
        u8 metLocation; // 0x9
        u8 metLevel; // 0xA
        u8 metGame; // 0xB
        u32 pid; // 0xC
        u32 exp; // 0x10
        u16 moves[MAX_MON_MOVES]; // 0x14
        u8 pp[MAX_MON_MOVES]; // 0x1C
        u32 currentHP; // 0x20
        u32 maxHP; // 0x22
        u16 stat[5];
        u16 atk; // 0x24
        u16 def;
        u16 speed;
        u16 spatk;
        u16 spdef;
        u16 item; // 0x2E
        u16 friendship; // 0x30
        u8 OTGender; // 0x32
        u8 nature; // 0x33
        u8 ppBonuses; // 0x34
        u8 sanity; // 0x35
        u8 OTName[17]; // 0x36
        u32 OTID; // 0x48
    } summary;
    u16 bgTilemapBuffers[2][SUMMARY_BG_COUNT][0x400];
    u8 mode;
    bool8 isBoxMon;
    u8 curMonIndex;
    u8 maxMonIndex;
    u8 currPageIndex;
    u8 minPageIndex;
    u8 maxPageIndex;
    bool8 lockMonFlag; // This is used to prevent the player from changing pokemon in the move deleter select, etc, but it is not needed because the input is handled differently there
    u16 newMove;
    u8 firstMoveIndex;
    u8 secondMoveIndex;
    bool8 lockMovesFlag; // This is used to prevent the player from changing position of moves in a battle or when trading.
    u8 bgDisplayOrder; // Determines the order page backgrounds are loaded while scrolling between them
    u8 filler40CA;
    u8 windowIds[8];
    u8 spriteIds[SPRITE_ARR_ID_COUNT];
    bool8 unk40EF;
    s16 switchCounter; // Used for various switch statement cases that decompress/load graphics or pokemon data
    u8 unk_filler4[6];
    u8 splitIconSpriteId;
} *sMonSummaryScreen = NULL;

